-- phpMyAdmin SQL Dump
-- version 5.0.1
-- https://www.phpmyadmin.net/
--
-- Host: 127.0.0.1
-- Generation Time: Oct 04, 2020 at 07:14 PM
-- Server version: 10.4.11-MariaDB
-- PHP Version: 7.2.27

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
SET AUTOCOMMIT = 0;
START TRANSACTION;
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8mb4 */;

--
-- Database: `weight_calc`
--

-- --------------------------------------------------------

--
-- Table structure for table `categories`
--

CREATE TABLE `categories` (
  `id` int(11) NOT NULL,
  `cat_name` varchar(100) NOT NULL,
  `cat_price_dis` varchar(100) NOT NULL,
  `cat_price_def` varchar(100) NOT NULL,
  `cat_source` varchar(100) NOT NULL,
  `type` int(11) NOT NULL,
  `empty_type` varchar(255) NOT NULL,
  `empty_weight` varchar(255) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

--
-- Dumping data for table `categories`
--

INSERT INTO `categories` (`id`, `cat_name`, `cat_price_dis`, `cat_price_def`, `cat_source`, `type`, `empty_type`, `empty_weight`) VALUES
(19, 'بسبوسة سادة ', '25', '35', 'شرقى', 1, '', ''),
(20, 'مكرونه', '25', '40', 'شرقى', 1, '', ''),
(21, 'بسبوسة مكسرات', '42', '60', 'شرقى', 1, '', ''),
(22, 'بسبوسة شامى', '35', '50', 'شرقى', 1, '', ''),
(23, 'بسكويت', '42', '60', 'شرقى', 1, '', ''),
(24, 'بسيمة + جوزيه', '42', '60', 'شرقى', 1, '', ''),
(25, 'بسيمة تركى', '42', '60', 'شرقى', 1, '', ''),
(26, 'بسيمة مكسرات', '42', '60', 'شرقى', 1, '', ''),
(27, 'بقلاوة', '40', '60', 'شرقى', 1, '', ''),
(28, 'بقلاوة حجاب', '35', '60', 'شرقى', 1, '', ''),
(29, 'بلح سادة', '30', '40', 'شرقى', 1, '', ''),
(30, 'بلح كريمة', '35', '50', 'شرقى', 1, '', ''),
(31, 'بورمة بندق', '50', '60', 'شرقى', 1, '', ''),
(32, 'بتى فور', '40', '65', 'شرقى', 1, '', ''),
(33, 'كنافة تركى قشطة', '35', '50', 'شرقى', 1, '', ''),
(34, 'تورته صغيرة', '50', '75', 'غربى', 0, '', ''),
(35, 'تورته كبيرة', '75', '100', 'غربى', 0, '', ''),
(36, 'قطعة جاتوه', '5', '6.5', 'غربى', 0, '', ''),
(37, 'جلاش أساور', '35', '50', 'شرقى', 1, '', ''),
(38, 'جلاش صوابع', '35', '50', 'شرقى', 1, '', ''),
(39, 'جوزيات', '45', '80', 'شرقى', 1, '', ''),
(40, 'حبيبة', '42', '60', 'شرقى', 1, '', ''),
(41, 'سابليه', '60', '80', 'شرقى', 1, '', ''),
(42, 'شكلمة', '42', '60', 'شرقى', 1, '', ''),
(43, 'عيون ورموش', '25', '35', 'شرقى', 1, '', ''),
(44, 'غريبة', '42', '60', 'غربى', 1, '', ''),
(45, 'فطيرة', '2.5', '3.5', 'شرقى', 0, '', ''),
(46, 'كنافة فواكه', '40', '60', 'شرقى', 1, '', ''),
(47, 'كعك عين جمل', '55', '85', 'غربى', 1, '', ''),
(48, 'كعك ملبن', '42', '60', 'غربى', 1, '', ''),
(49, 'كنافة بوريو', '35', '50', 'شرقى', 1, '', ''),
(50, 'كنافة جيلى', '35', '50', 'شرقى', 1, '', ''),
(51, 'كنافة سورى بندق', '45', '60', 'شرقى', 1, '', ''),
(52, 'كنافة صوابع', '35', '50', 'شرقى', 1, '', ''),
(53, 'كنافة عجوة', '35', '60', 'شرقى', 1, '', ''),
(54, 'كنافة فراولة وموز', '35', '50', 'شرقى', 1, '', ''),
(55, 'كنافة كريمة', '25', '40', 'شرقى', 1, '', ''),
(56, 'كنافة مكسرات', '45', '60', 'شرقى', 1, '', ''),
(57, 'كنافة موز', '35', '50', 'شرقى', 1, '', ''),
(58, 'كوباية ترافل', '4', '7', 'غربى', 0, '', ''),
(59, 'لديدة وحمام', '55', '80', 'شرقى', 1, '', ''),
(60, 'لينزا', '30', '50', 'شرقى', 1, '', ''),
(61, 'هريسة مكسرات', '42', '60', 'شرقى', 1, '', ''),
(62, 'نمورة روانى', '25', '50', 'شرقى', 1, '', ''),
(63, 'مشبك', '14', '20', 'شرقى', 1, '', ''),
(64, 'هريسة محشية', '25', '35', 'شرقى', 1, '', ''),
(65, 'كنافة كورنيه', '35', '50', 'شرقى', 1, '', ''),
(66, 'تورته 30×30', '120', '180', 'غربى', 0, '', ''),
(67, 'تورتة 30×30 بالصورة', '150', '250', 'غربى', 0, '', ''),
(68, 'تورتة 30 × 40', '150', '250', 'غربى', 0, '', ''),
(69, 'تورتة 30×40 بالصورة', '180', '300', 'غربى', 0, '', ''),
(70, 'تورتة 40×60', '250', '350', 'غربى', 0, '', ''),
(71, 'تورتة 40×60 بالصورة', '280', '400', 'غربى', 0, '', ''),
(72, 'أطباق 2 ك تقيل', '90', '90', 'شرقى', 0, '', ''),
(73, 'أطباق 2 ك خفيف', '55', '55', 'شرقى', 0, '', ''),
(74, 'أطباق 1 ك تقيل', '80', '80', 'شرقى', 0, '', ''),
(75, 'أطباق 1 ك خفيف', '45', '45', 'شرقى', 0, '', ''),
(76, 'أطباق نص تقيل ', '65', '65', 'شرقى', 0, '', ''),
(77, 'أطباق نص خفيف', '30', '30', 'شرقى', 0, '', ''),
(78, 'أطباق فطير كبير', '20', '20', 'شرقى', 0, '', ''),
(79, 'أطباق فطير صغير', '10', '10', 'شرقى', 0, '', ''),
(80, 'صاج فطير', '90', '126', 'شرقى', 0, '', ''),
(81, 'أكياس زهانة', '27', '27', 'شرقى', 0, '', ''),
(82, 'أكياس طارق بلاستيك', '29', '29', 'شرقى', 0, '', ''),
(83, 'ورق كيلو', '18', '18', 'شرقى', 0, '', ''),
(84, 'علبة تورتة فضى ', '4', '4', 'شرقى', 0, '', ''),
(85, 'علبة تورتة زكريا', '6', '6', 'غربى', 0, '', ''),
(86, 'علبة قطعتين', '75.', '0.75', 'غربى', 0, '', ''),
(87, 'علبة دستة خفيف', '2.5', '2.5', 'غربى', 0, '', ''),
(88, 'علبة دستة كرتون', '3', '3', 'شرقى', 0, '', ''),
(89, 'علبة بيتى فور ابيض', '2.5', '2.5', 'شرقى', 0, '', ''),
(90, 'علب بسكويت', '3', '3', 'غربى', 0, '', ''),
(91, 'علبة قشطة شهاب', '30', '30', 'شرقى', 0, '', ''),
(92, 'علبة قشطة ميلكو', '33', '33', 'شرقى', 0, '', '');

-- --------------------------------------------------------

--
-- Table structure for table `clients`
--

CREATE TABLE `clients` (
  `ClientID` int(11) NOT NULL,
  `ClientName` varchar(255) NOT NULL,
  `ClientCode` int(11) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

--
-- Dumping data for table `clients`
--

INSERT INTO `clients` (`ClientID`, `ClientName`, `ClientCode`) VALUES
(1, 'فرع الدراسات', 1),
(2, 'فرع نبروه', 2);

-- --------------------------------------------------------

--
-- Table structure for table `invoice`
--

CREATE TABLE `invoice` (
  `id` int(11) NOT NULL,
  `invoice_no` int(11) NOT NULL,
  `no` int(11) NOT NULL,
  `cat_name` varchar(100) NOT NULL,
  `empty_name` varchar(100) NOT NULL,
  `empty_value` varchar(100) NOT NULL,
  `cat_weight` varchar(100) NOT NULL,
  `Unit` varchar(255) NOT NULL,
  `gm_weight` varchar(100) NOT NULL,
  `net_weight` varchar(100) NOT NULL,
  `cat_price_dis` varchar(100) NOT NULL,
  `cat_price_def` varchar(100) NOT NULL,
  `total_purchase` varchar(100) NOT NULL,
  `total_sale` varchar(255) NOT NULL,
  `profit` varchar(100) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

--
-- Dumping data for table `invoice`
--

INSERT INTO `invoice` (`id`, `invoice_no`, `no`, `cat_name`, `empty_name`, `empty_value`, `cat_weight`, `Unit`, `gm_weight`, `net_weight`, `cat_price_dis`, `cat_price_def`, `total_purchase`, `total_sale`, `profit`) VALUES
(146, 1, 1, 'بسبوسة سادة ', 'سدر بشفة', '2900', '8290', 'الكيلو جرام', '5390', '5.39', '25', '35', '134.75', '188.65', '53.9'),
(147, 1, 2, 'بسيمة + جوزيه', 'سرفيس جاتوه كبير', '380', '3380', 'الكيلو جرام', '3000', '3', '42', '60', '126', '180', '54'),
(148, 1, 3, 'شكلمة', 'سرفيس جاتوه كبير', '380', '2740', 'الكيلو جرام', '2360', '2.36', '42', '60', '99.12', '141.6', '42.48'),
(149, 1, 4, 'حبيبة', 'سرفيس جاتوه كبير', '380', '2659', 'الكيلو جرام', '2279', '2.279', '42', '60', '95.718', '136.74', '41.022'),
(150, 1, 5, 'عيون ورموش', 'سرفيس جاتوه كبير', '380', '2175', 'الكيلو جرام', '1795', '1.795', '25', '35', '44.875', '62.825', '17.95'),
(151, 1, 6, 'كنافة صوابع', 'سرفيس جاتوه كبير', '380', '3400', 'الكيلو جرام', '3020', '3.02', '35', '50', '105.7', '151', '45.3'),
(152, 1, 7, 'بلح كريمة', 'سرفيس جاتوه كبير', '380', '2250', 'الكيلو جرام', '1870', '1.87', '35', '50', '65.45', '93.5', '28.05'),
(153, 1, 8, 'بلح سادة', 'صنية 28', '210', '2550', 'الكيلو جرام', '2340', '2.34', '30', '40', '70.2', '93.6', '23.4'),
(154, 1, 9, 'كنافة كورنيه', 'سرفيس جاتوه كبير', '380', '1600', 'الكيلو جرام', '1220', '1.22', '35', '50', '42.7', '61', '18.3'),
(155, 1, 10, 'كنافة كريمة', 'صنية صغيرة', '920', '2700', 'الكيلو جرام', '1780', '1.78', '25', '40', '44.5', '71.2', '26.7'),
(156, 1, 11, 'كنافة مكسرات', 'صنية صغيرة', '920', '3950', 'الكيلو جرام', '3030', '3.03', '45', '60', '136.35', '181.8', '45.45'),
(157, 1, 12, 'بسبوسة شامى', 'صنية صغيرة', '920', '3400', 'الكيلو جرام', '2480', '2.48', '35', '50', '86.8', '124', '37.2'),
(158, 1, 13, 'كنافة تركى قشطة', 'صنية صغيرة', '920', '2400', 'الكيلو جرام', '1480', '1.48', '35', '50', '51.8', '74', '22.2'),
(159, 1, 14, 'بورمة بندق', 'صنية صغيرة', '920', '3785', 'الكيلو جرام', '2865', '2.865', '50', '60', '143.25', '171.9', '28.65'),
(160, 1, 15, 'بقلاوة حجاب', 'صنية بقلاوة وسط ', '1250', '3400', 'الكيلو جرام', '2150', '2.15', '35', '60', '75.25', '129', '53.75'),
(161, 1, 16, 'بسيمة + جوزيه', 'صنية وسط', '1750', '6000', 'الكيلو جرام', '4250', '4.25', '42', '60', '178.5', '255', '76.5'),
(162, 1, 17, 'بسبوسة مكسرات', 'سدر بدون شفة ', '1900', '8050', 'الكيلو جرام', '6150', '6.15', '42', '60', '258.3', '369', '110.7'),
(163, 1, 18, 'جلاش أساور', 'صنية بقلاوة وسط ', '1250', '4190', 'الكيلو جرام', '2940', '2.94', '35', '50', '102.9', '147', '44.1'),
(164, 1, 19, 'كنافة سورى بندق', 'صنية وسط', '1750', '5045', 'الكيلو جرام', '3295', '3.295', '45', '60', '148.275', '197.7', '49.425'),
(165, 1, 20, 'جلاش صوابع', 'صنية دوار ', '2350', '5850', 'الكيلو جرام', '3500', '3.5', '35', '50', '122.5', '175', '52.5'),
(166, 1, 21, 'بسبوسة سادة ', 'سدر بشفة', '2900', '8450', 'الكيلو جرام', '5550', '5.55', '25', '35', '138.75', '194.25', '55.5'),
(167, 1, 22, 'هريسة مكسرات', 'صنية دوار ', '2350', '8850', 'الكيلو جرام', '6500', '6.5', '42', '60', '273', '390', '117'),
(168, 1, 23, 'لينزا', 'صنية صغيرة', '920', '3970', 'الكيلو جرام', '3050', '3.05', '30', '50', '91.5', '152.5', '61'),
(169, 1, 24, 'مكرونه', 'صنية صغيرة', '920', '3595', 'الكيلو جرام', '2675', '2.675', '25', '40', '66.875', '107', '40.125'),
(170, 1, 25, 'تورته كبيرة', 'اختر نوع الفارغ', '', '5', 'قطعة', '', '', '75', '100', '375', '500', '125'),
(171, 1, 26, 'قطعة جاتوه', 'اختر نوع الفارغ', '', '75', 'قطعة', '', '', '5', '6.5', '375', '487.5', '112.5'),
(172, 2, 1, 'هريسة محشية', 'صنية دوار ', '2350', '9500', 'الكيلو جرام', '7150', '7.15', '25', '35', '178.75', '250.25', '71.5'),
(173, 2, 2, 'كعك ملبن', 'سرفيس أبيض', '670', '6260', 'الكيلو جرام', '5590', '5.59', '42', '60', '234.78', '335.4', '100.62'),
(174, 2, 3, 'صاج فطير', 'بدون', '0', '2', 'قطعة', '', '', '90', '126', '180', '252', '72'),
(175, 2, 4, 'تورته كبيرة', 'بدون', '0', '3', 'قطعة', '', '', '75', '100', '225', '300', '75'),
(176, 2, 5, 'تورتة 30×30 بالصورة', 'بدون', '0', '1', 'قطعة', '', '', '150', '250', '150', '250', '100'),
(177, 2, 6, 'قطعة جاتوه', 'بدون', '0', '65', 'قطعة', '', '', '5', '6.5', '325', '422.5', '97.5'),
(178, 2, 7, 'أطباق 2 ك تقيل', 'بدون', '0', '2', 'قطعة', '', '', '90', '90', '180', '180', '0'),
(179, 2, 8, 'أطباق 2 ك خفيف', 'بدون', '0', '2', 'قطعة', '', '', '55', '55', '110', '110', '0'),
(180, 2, 9, 'أطباق 1 ك تقيل', 'بدون', '0', '2', 'قطعة', '', '', '80', '80', '160', '160', '0'),
(181, 2, 10, 'أطباق 1 ك خفيف', 'بدون', '0', '2', 'قطعة', '', '', '45', '45', '90', '90', '0'),
(182, 2, 11, 'أطباق نص تقيل ', 'بدون', '0', '2', 'قطعة', '', '', '65', '65', '130', '130', '0'),
(183, 2, 12, 'أطباق فطير كبير', 'بدون', '0', '2', 'قطعة', '', '', '20', '20', '40', '40', '0'),
(184, 2, 13, 'أطباق فطير صغير', 'بدون', '0', '3', 'قطعة', '', '', '10', '10', '30', '30', '0'),
(185, 1, 27, 'أكياس طارق بلاستيك', 'نوع الفارغ...', '', '3', '', '', '', '29', '29', '87', '87', '0'),
(186, 1, 28, 'بتى فور', 'سرفيس جاتوه كبير', '380', '2165', '', '1785', '1.785', '40', '65', '71.4', '116.025', '44.625'),
(187, 1, 29, 'بتى فور', 'سرفيس جاتوه كبير', '380', '2255', '', '1875', '1.875', '40', '65', '75', '121.875', '46.875'),
(188, 1, 30, 'بتى فور', 'سرفيس جاتوه كبير', '380', '2185', '', '1805', '1.805', '40', '65', '72.2', '117.325', '45.125'),
(189, 1, 31, 'بتى فور', 'سرفيس جاتوه كبير', '380', '2200', '', '1820', '1.82', '40', '65', '72.8', '118.3', '45.5'),
(190, 1, 32, 'بتى فور', 'سرفيس جاتوه كبير', '380', '2300', '', '1920', '1.92', '40', '65', '76.8', '124.8', '48'),
(191, 3, 1, 'تورته كبيرة', 'بدون', '0', '5', 'قطعة', '', '', '75', '100', '375', '500', '125'),
(192, 3, 2, 'قطعة جاتوه', 'بدون', '0', '75', 'قطعة', '', '', '5', '6.5', '375', '487.5', '112.5'),
(193, 3, 3, 'علبة قشطة شهاب', 'بدون', '0', '3', 'قطعة', '', '', '30', '30', '90', '90', '0'),
(194, 4, 1, 'بقلاوة', 'صنية بقلاوة وسط ', '1250', '2800', 'الكيلو جرام', '1550', '1.55', '40', '60', '62', '93', '31'),
(195, 4, 2, 'بقلاوة حجاب', 'صنية بقلاوة وسط ', '1250', '4490', 'الكيلو جرام', '3240', '3.24', '35', '60', '113.4', '194.4', '81'),
(196, 4, 3, 'مكرونه', 'صنية صغيرة', '920', '3690', 'الكيلو جرام', '2770', '2.77', '25', '40', '69.25', '110.8', '41.55'),
(197, 4, 4, 'كنافة تركى قشطة', 'صنية صغيرة', '920', '1760', 'الكيلو جرام', '840', '0.84', '35', '50', '29.4', '42', '12.6'),
(198, 4, 5, 'كنافة كريمة', 'صنية صغيرة', '920', '3835', 'الكيلو جرام', '2915', '2.915', '25', '40', '72.875', '116.6', '43.725'),
(199, 4, 6, 'لينزا', 'صنية صغيرة', '920', '4025', 'الكيلو جرام', '3105', '3.105', '30', '50', '93.15', '155.25', '62.1'),
(200, 4, 7, 'بلح سادة', 'صنية 28', '210', '1420', 'الكيلو جرام', '1210', '1.21', '30', '40', '36.3', '48.4', '12.1'),
(201, 4, 8, 'بلح كريمة', 'سرفيس جاتوه كبير', '380', '1815', 'الكيلو جرام', '1435', '1.435', '35', '50', '50.225', '71.75', '21.525'),
(202, 4, 9, 'بسبوسة سادة ', 'سدر بشفة', '2900', '7230', 'الكيلو جرام', '4330', '4.33', '25', '35', '108.25', '151.55', '43.3'),
(203, 4, 10, 'بسبوسة مكسرات', 'سدر بدون شفة ', '1900', '8720', 'الكيلو جرام', '6820', '6.82', '42', '60', '286.44', '409.2', '122.76'),
(204, 4, 11, 'صاج فطير', 'بدون', '0', '1', 'قطعة', '', '', '90', '126', '90', '126', '36'),
(205, 4, 12, 'تورته كبيرة', 'بدون', '0', '4', 'قطعة', '', '', '75', '100', '300', '400', '100'),
(206, 4, 13, 'قطعة جاتوه', 'بدون', '0', '80', 'قطعة', '', '', '5', '6.5', '400', '520', '120');

-- --------------------------------------------------------

--
-- Table structure for table `total`
--

CREATE TABLE `total` (
  `id` int(11) NOT NULL,
  `invoice_no` varchar(100) NOT NULL,
  `date` date NOT NULL,
  `ClientName` varchar(255) NOT NULL,
  `ClientCode` varchar(255) NOT NULL,
  `sum_purchase` varchar(100) NOT NULL,
  `sum_sale` varchar(255) NOT NULL,
  `net_profit` varchar(100) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

--
-- Dumping data for table `total`
--

INSERT INTO `total` (`id`, `invoice_no`, `date`, `ClientName`, `ClientCode`, `sum_purchase`, `sum_sale`, `net_profit`) VALUES
(65, '1', '2020-05-31', 'فرع الدراسات', '1', '3908.263', '5521.09', '1612.827'),
(66, '2', '2020-06-01', 'فرع الدراسات', '1', '2033.53', '2550.15', '516.62'),
(67, '3', '2020-06-02', 'فرع الدراسات', '1', '840', '1077.5', '237.5'),
(68, '4', '2020-06-03', 'فرع الدراسات', '1', '1711.29', '2438.95', '727.66');

-- --------------------------------------------------------

--
-- Table structure for table `units`
--

CREATE TABLE `units` (
  `id` int(11) NOT NULL,
  `unit_name` varchar(255) NOT NULL,
  `unit_code` int(11) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

--
-- Dumping data for table `units`
--

INSERT INTO `units` (`id`, `unit_name`, `unit_code`) VALUES
(1, 'الكيلوجرام', 1),
(2, 'قطعة', 0),
(3, 'الجالون', 2),
(4, 'االسنتيمتر', 3);

-- --------------------------------------------------------

--
-- Table structure for table `weights`
--

CREATE TABLE `weights` (
  `id` int(11) NOT NULL,
  `weight_name` varchar(100) NOT NULL,
  `weight` varchar(100) NOT NULL,
  `weight_code` int(11) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

--
-- Dumping data for table `weights`
--

INSERT INTO `weights` (`id`, `weight_name`, `weight`, `weight_code`) VALUES
(10, 'سدر بشفة', '2900', 1),
(11, 'سدر بدون شفة ', '1900', 2),
(12, 'صنية 28', '210', 3),
(13, 'صنية وسط', '1750', 4),
(14, 'صنية بقلاوة وسط ', '1250', 5),
(15, 'صنية دوار ', '2350', 6),
(16, 'صنية صغيرة', '920', 7),
(20, 'صنية سدر', '1900', 8),
(21, 'سدر بشفة', '2900', 9),
(22, 'صفيحة عسل', '1000', 10),
(23, 'صاج 40×40', '1500', 11),
(24, 'سرفيس ذهبى', '385', 12),
(25, 'سرفيس كعك كبير', '320', 13),
(26, 'سرفيس بلح كبير', '410', 14),
(27, 'صاج 40×60 ثقيل عالى', '1470', 15),
(28, 'سرفيس أبيض', '670', 16),
(29, 'سرفيس جاتوه كبير', '380', 17),
(30, 'سرفيس جاتوه رفيع', '320', 18);

--
-- Indexes for dumped tables
--

--
-- Indexes for table `categories`
--
ALTER TABLE `categories`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `clients`
--
ALTER TABLE `clients`
  ADD PRIMARY KEY (`ClientID`);

--
-- Indexes for table `invoice`
--
ALTER TABLE `invoice`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `total`
--
ALTER TABLE `total`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `units`
--
ALTER TABLE `units`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `weights`
--
ALTER TABLE `weights`
  ADD PRIMARY KEY (`id`);

--
-- AUTO_INCREMENT for dumped tables
--

--
-- AUTO_INCREMENT for table `categories`
--
ALTER TABLE `categories`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=93;

--
-- AUTO_INCREMENT for table `clients`
--
ALTER TABLE `clients`
  MODIFY `ClientID` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=5;

--
-- AUTO_INCREMENT for table `invoice`
--
ALTER TABLE `invoice`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=207;

--
-- AUTO_INCREMENT for table `total`
--
ALTER TABLE `total`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=69;

--
-- AUTO_INCREMENT for table `units`
--
ALTER TABLE `units`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=5;

--
-- AUTO_INCREMENT for table `weights`
--
ALTER TABLE `weights`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=31;
COMMIT;

/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
